---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSizeSet.GetEnumerator
source: html/669d0340-819d-ec62-9dfd-08cc56250ec2.htm
---
# Autodesk.Revit.DB.Electrical.WireSizeSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.